{
	"_meta": {
		"sources": [{
			"json": "WorldOfLightClasses",
			"abbreviation": "WOL:R",
			"color": "A8FFD8",
			"full": "The World of Light: Revised Class Features",
			"authors": [
				"Arcane"
			],
			"version": "17.11.2025",
			"url": "-",
			"targetSchema": "1.2.0"
		}],
		"dateAdded": 1
	},
	"classFeature": [
		{
			"name": "Master of Magic",
			"source": "WorldOfLightClasses",
			"className": "Wizard",
			"classSource": "XPHB",
			"isClassFeatureVariant": true,
			"level": 20,
			"entries": [
				"{@i 20th-level Wizard {@variantrule optional class features|tce|optional feature}}",
				"At 20th level, your knowledge of magic allows you to duplicate almost any spell. As a bonus action, you can call to mind the ability to cast one spell of your choice from any class’s spell list. The spell must be of a level for which you have spell slots, you mustn’t have it prepared, and you follow the normal rules for casting it, including expending a spell slot. If the spell isn’t a wizard spell, it counts as a wizard spell when you cast it. The ability to cast the spell vanishes from your mind when you cast it or when the current turn ends.",
				"Once you use this feature, you can’t use this feature again until you finish a long rest."
			]
		},

		{
			"name": "Favored Foe",
			"source": "WorldOfLightClasses",
			"className": "Ranger",
			"classSource": "XPHB",
			"level": 1,
			"entries": [
				"{@i 1st-level ranger {@variantrule optional class features|tce|optional feature}, which replaces the Favored Enemy feature} and works with the Foe Slayer feature",
				"Starting at 1st level, you have significant experience studying, tracking, hunting, and even talking to creatures found within the natural world. You gain the following benefits:",
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"name": "Hunter's Resolve",
							"entries": [
								"You always have the {@spell Hunter's Mark|XPHB} spell prepared. You can cast it twice without expending a spell slot, and you regain all expended uses of this ability when you finish a {@variantrule Long Rest|XPHB}.",
								"The number of times you can cast the spell without a spell slot increases when you reach certain Ranger levels, as shown in the Favored Enemy column of the Ranger Features table."
							]
						},
						{
							"type": "entries",
							"name": "Favored Enemy",
							"entries": [
								"Choose a type of favored enemy: {@filter beasts|bestiary|type=beast}, {@filter fey|bestiary|type=fey}, {@filter humanoids|bestiary|type=humanoid}, {@filter monstrosities|bestiary|type=monstrosity}, or {@filter undead|bestiary|type=undead}. You gain a +2 bonus to damage rolls with weapon attacks against creatures of the chosen type. Additionally, you have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them. Whenever you finish a Long Rest, you can change the favored enemy you chose.",
								"When you gain this feature, you also learn one language of your choice, typically one spoken by your most researched favored enemy or creatures associated with it. However, you are free to pick any language you wish to learn."
							]
						}
					]
				}
			]
		},
		{
			"name": "Natural Explorer",
			"source": "WorldOfLightClasses",
			"className": "Ranger",
			"classSource": "XPHB",
			"level": 2,
			"entries": [
				"{@i 2nd-level ranger optional feature, which replaces the Deft Explorer feature.}",
				"You are an unsurpassed explorer and survivor, both in the wilderness and in dealing with others on your travels. You gain the following benefits.",
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"name": "Deft Explorer",
							"entries": [
								"You are a master of navigating the natural world, and you react with swift and decisive action when attacked. This grants you the following benefits:",
								{
									"type": "list",
									"items": [
										"You ignore difficult terrain.",
										"You have advantage on initiative rolls.",
										"On your first turn during combat, you have advantage on attack rolls against creatures that have not yet acted."
									]
								},
								"In addition, you are skilled at navigating the wilderness. You gain the following benefits when traveling for an hour or more:",
								{
									"type": "list",
									"items": [
										"Difficult terrain doesn't slow your group's travel.",
										"Your group can't become lost except by magical means.",
										"Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger.",
										"If you are traveling alone, you can move stealthily at a normal pace.",
										"When you forage, you find twice as much food as you normally would.",
										"While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area."
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Canny",
							"entries": [
								"Choose one of your skill proficiencies with which you lack {@variantrule Expertise|XPHB}. You gain {@variantrule Expertise|XPHB} in that skill.",
								"In addition, you know two languages of your choice from the language tables in {@book chapter 2|XPHB|2|Choose Languages}."
							]
						}
					]
				}
			]
		},
		{
			"name": "Venatorial Focus",
			"source": "WorldOfLightClasses",
			"className": "Ranger",
			"classSource": "XPHB",
			"level": 5,
			"entries": [
				"{@i 5th-level ranger {@variantrule optional class features|tce|optional feature}}",
				"Your Hunter's Mark die is now a {@dice d8} instead of a {@dice d6}."
			]
		},
		{
			"name": "Relentless Hunter",
			"source": "WorldOfLightClasses",
			"className": "Ranger",
			"classSource": "XPHB",
			"level": 13,
			"entries": [
				"{@i 13th-level ranger {@variantrule optional class features|tce|optional feature}, which replaces the original Relentless Hunter feature}",
				"Your Hunter's Mark no longer requires {@status Concentration|XPHB}. Additionally, your Hunter's Mark die is now a {@dice d12} instead of a {@dice d8}."
			]
		},
		{
			"name": "Foe Slayer",
			"source": "WorldOfLightClasses",
			"className": "Ranger",
			"classSource": "XPHB",
			"level": 20,
			"entries": [
				"{@i 20th-level ranger {@variantrule optional class features|tce|optional feature}, which replaces the original Foe Slayer feature}",
				"Your connection with the natural world has exalted you to greater heights. Your Dexterity and Wisdom scores increase by 4, to a maximum of 25.",
				"In addition, the damage die of your Hunter's Mark is now a {@dice d20} rather than a {@dice d12}."
			]
		}
	]
}